Autodesk.Revit.Exceptions.RegenerationFailedException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
Retrieves data needed to serialize the target object.
info:
Data needed to serialize or deserialize the object.
context:
The destination of the serialized stream.

Autodesk.Revit.Exceptions.RegenerationFailedException
The exception that is thrown when a regeneration operation failed.